% локализуем корень графическим способом
x = -1.0:0.01:3.0;
y = 2*x + x/(1+x.^2) - 4 - acot(x);
plot(x,y);
grid on;
% видим - корень лежит в промежутке (2.0;2.2)

f = inline('2*x + x/(1+x^2) - 4 - acot(x)');
x0 = 0.0; % начальное приближение 
eps = 0.00001; % точность
N = 50; % максимальное количество итераций
g = inline('(4+acot(x)-x/(1+x^2))/2');
x1 = g(x0); % первое значение 
for i = 1 : N
    if abs(x1 - x0) <= eps
        break
    end
    x0 = x1;
    x1 = g(x0);
end
% вывод решения уравнения
x1
% вывод количества итераций
i